# remote explorer
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer

# spell checker
streetsidesoftware.code-spell-checker

# navigation
vscodevim.vim
cunbidun.flash-vscode

# AIs
github.copilot
github.copilot-chat
saoudrizwan.claude-dev

# build tools
bazelbuild.vscode-bazel

#########
# THEME # 
#########
arcticicestudio.nord-visual-studio-code
jdinhlife.gruvbox
pkief.material-icon-theme

#############
# LANGUAGES #
#############
# docker 
ms-azuretools.vscode-docker

# nix 
kamadorueda.alejandra
bbenoist.nix

# bash
timonwong.shellcheck
foxundermoon.shell-format

# latex
james-yu.latex-workshop

# lua 
yinfei.luahelper

# cpp 
ms-vscode.cpptools
ms-vscode.cmake-tools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools

# python 
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.isort
ms-python.black-formatter
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow

# ts
dbaeumer.vscode-eslint

# New extensions added:
docker.docker
tomoki1207.pdf
activitywatch.aw-watcher-vscode
ms-azuretools.vscode-containers
