activitywatch.aw-watcher-vscode
arcticicestudio.nord-visual-studio-code
bazelbuild.vscode-bazel
bbenoist.nix
catppuccin.catppuccin-vsc
charliermarsh.ruff
cunbidun.flash-vscode
foxundermoon.shell-format
github.copilot
github.copilot-chat
github.vscode-pull-request-github
james-yu.latex-workshop
kamadorueda.alejandra
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cpptools
ms-vscode.remote-explorer
pkief.material-icon-theme
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
timonwong.shellcheck
vscodevim.vim
zhuangtongfa.material-theme
